ErpTest/src/Reports/ItobОтчетПоПростоямПриЗаведенномДвигателе/ItobОтчетПоПростоямПриЗаведенномДвигателе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ItobОтчетПоПростоямПриЗаведенномДвигателе</name>
  <comment>Отчет по простоям при включенном зажигании</comment>
  <attributes>
    <name>НачПериода</name>
    <comment>Начало периода</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонПериода</name>
    <comment>Конец периода</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Датчик</name>
    <type>
      <types>CatalogRef.ItobДатчики</types>
    </type>
  </attributes>
</mdclass:Report>

ErpTest/src/InformationRegisters/ItobПривязкиТерминалов/ItobПривязкиТерминалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ItobПривязкиТерминалов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТерминалУстановлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.ItobТерминалы</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/ItobСостоянияТерминалов/ItobСостоянияТерминалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ItobСостоянияТерминалов</name>
  <enumValues>
    <name>Движение</name>
  </enumValues>
  <enumValues>
    <name>Стоянка</name>
  </enumValues>
  <enumValues>
    <name>НетДанных</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/ItobНазначенияДатчиков/ItobНазначенияДатчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItobНазначенияДатчиков</name>
  <predefined>
    <items>
      <name>Зажигание</name>
      <description>Зажигание</description>
    </items>
    <items>
      <name>ПробегCAN</name>
      <description>Пробег (CAN шина)</description>
    </items>
    <items>
      <name>РасходТопливаИмпульсный</name>
      <description>Расход топлива</description>
    </items>
    <items>
      <name>РасходТопливаCAN</name>
      <description>Расход топлива (CAN шина)</description>
    </items>
    <items>
      <name>Топливо</name>
      <description>Топливо</description>
    </items>
    <items>
      <name>ТревожнаяКнопка</name>
      <description>Тревожная кнопка</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатчикТоплива</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПоказаний</name>
    <attributes>
      <name>Показание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Reports/ItobОтчетПоПростоямПриЗаведенномДвигателе/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Функция выполняет формирование табличного документа отчета по простоям.
//
Функция СформироватьОтчетПоПростоямПриЗаведенномДвигателе(НачПериода, КонПериода, Объект)
	
	ТабДокумент = Новый ТабличныйДокумент;	
	Макет = ПолучитьМакет("Макет");
	
	СрезНаНачало = РегистрыСведений.ItobПривязкиТерминалов.ПолучитьПоследнее(НачалоДня(НачПериода)-1, 
	                                                              Новый Структура("Объект", Объект));
	Если НЕ ЗначениеЗаполнено(СрезНаНачало.Терминал) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для объекта не привязан терминал!'"));
		Возврат ТабДокумент;
	
	КонецЕсли;
	
	Терминал = СрезНаНачало.Терминал;
	СтрокаДатчики = Терминал.Датчики.Найти(Справочники.ItobНазначенияДатчиков.Зажигание,"Назначение");
	Если СтрокаДатчики = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для терминала не указан датчик зажигания!'"));
		Возврат ТабДокумент;	
	
	КонецЕсли;
	
	Датчик = СтрокаДатчики.Датчик;
	
	Если Датчик.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для терминала не указан датчик зажигания!'"));
		Возврат ТабДокумент;	
	
	КонецЕсли;
	
	ОбластьШапка         = Макет.ПолучитьОбласть("Шапка");
	ОбластьДетали        = Макет.ПолучитьОбласть("Детали");
	ОбластьГруппировка   = Макет.ПолучитьОбласть("Группировка");
	
	ОбластьШапка.Параметры.ЗаголовокОтчета = НСтр("ru = 'Отчет по простоям при включенном зажигании за'")+" "
	                                          +ПредставлениеПериода(НачПериода, КонПериода);
	ОбластьШапка.Параметры.Объект = НСтр("ru = 'Объект мониторинга:'")+" "+Объект;
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	ВключатьДанныеДатчиков = Новый Массив;
	ВключатьДанныеДатчиков.Добавить(Датчик);
	
	// Интервалы движения
	ТабИнтервалыДвижения = ItobОперативныйМониторингКлиентСервер.ПолучитьИнтервалыДвижения(Объект, НачПериода,
	                                                  КонПериода, Истина, ВключатьДанныеДатчиков);
	
	ИмяКолонкиЗажигание = "ЗначениеДатчика"+Формат(Датчик.Код, "ЧН=0; ЧГ=0");
	
	ИтогоЗажиганиеВключено = 0;
	ИтогоЗажиганиеВыключено = 0;
	НомерПП = 1;
	
	Для Счетчик = 0 По ТабИнтервалыДвижения.Количество()-1 Цикл
		
		Если ТабИнтервалыДвижения[Счетчик].Состояние = Перечисления.ItobСостоянияТерминалов.Стоянка Тогда
			
			// Вывод стоянки в таблицу
			ОбластьГруппировка.Параметры.НомерПП = НомерПП;
			ОбластьГруппировка.Параметры.Событие = "Стоянка";
			ОбластьГруппировка.Параметры.НачДата = ТабИнтервалыДвижения[Счетчик].ВремяНач;
			ОбластьГруппировка.Параметры.КонДата = ТабИнтервалыДвижения[Счетчик].ВремяКон;
			ОбластьГруппировка.Параметры.Продолжительность = ItobОперативныйМониторингКлиентСервер.ПредставлениеВремени(ТабИнтервалыДвижения[Счетчик].Длительность);		
			ОбластьГруппировка.Параметры.Место = ТабИнтервалыДвижения[Счетчик].МестоСтоянки;
			
			ОбластьГруппировка.Параметры.Расшифровка = Новый Структура("НачПериода,КонПериода,Объект",
				ТабИнтервалыДвижения[Счетчик].ВремяНач, ТабИнтервалыДвижения[Счетчик].ВремяКон, Объект);
			
			ТабДокумент.Вывести(ОбластьГруппировка);
			
			// Анализ зажигания в период стоянки
			
			СтрокаНачалаДиапазона = ТабИнтервалыДвижения[Счетчик].ДанныеТерминала[0];
						
			НомерСостояния = 1;
						
			Для СчетчикДТ=1 По ТабИнтервалыДвижения[Счетчик].ДанныеТерминала.Количество()-1 Цикл
				
				Если ТабИнтервалыДвижения[Счетчик].ДанныеТерминала[СчетчикДТ][ИмяКолонкиЗажигание] <> СтрокаНачалаДиапазона[ИмяКолонкиЗажигание]
					ИЛИ СчетчикДТ = ТабИнтервалыДвижения[Счетчик].ДанныеТерминала.Количество()-1 Тогда
					
					НачалоИнтервала = СтрокаНачалаДиапазона.Период;
					КонецИнтервала = ТабИнтервалыДвижения[Счетчик].ДанныеТерминала[СчетчикДТ].Период
						- ?(СчетчикДТ = ТабИнтервалыДвижения[Счетчик].ДанныеТерминала.Количество()-1,0,1);
						
					Если СчетчикДТ = ТабИнтервалыДвижения[Счетчик].ДанныеТерминала.Количество()-1 Тогда
						КонецИнтервала = ТабИнтервалыДвижения[Счетчик].ВремяКон;								
					
					КонецЕсли;	
					
					ОбластьДетали.Параметры.НомерПП = ""+НомерПП+"."+НомерСостояния;
					ОбластьДетали.Параметры.Событие = ?(СтрокаНачалаДиапазона[ИмяКолонкиЗажигание]=0,
					                                      НСтр("ru = 'Зажигание выключено'"),
														  НСтр("ru = 'Зажигание включено'"));
					ОбластьДетали.Параметры.НачДата = НачалоИнтервала;
					ОбластьДетали.Параметры.КонДата = КонецИнтервала;
					ОбластьДетали.Параметры.Продолжительность = ItobОперативныйМониторингКлиентСервер.ПредставлениеВремени
					                                                        (КонецИнтервала-НачалоИнтервала+1);
										
					ОбластьДетали.Параметры.Расшифровка = Новый Структура("НачПериода,КонПериода,Объект",НачалоИнтервала,КонецИнтервала,Объект);
					
					ТабДокумент.Вывести(ОбластьДетали);
					
					НомерСостояния = НомерСостояния+1;
					
					Если СтрокаНачалаДиапазона[ИмяКолонкиЗажигание] = 0 Тогда
						ИтогоЗажиганиеВыключено = ИтогоЗажиганиеВыключено + (КонецИнтервала-НачалоИнтервала+1);
					Иначе
						ИтогоЗажиганиеВключено = ИтогоЗажиганиеВключено + (КонецИнтервала-НачалоИнтервала+1);
						
						// Подсветка строки таблицы
						ТабДокумент.Область(ТабДокумент.ВысотаТаблицы,2,ТабДокумент.ВысотаТаблицы,
						                ТабДокумент.ШиринаТаблицы).ЦветФона = WebЦвета.Персиковый;
						
					КонецЕсли;
					
					СтрокаНачалаДиапазона = ТабИнтервалыДвижения[Счетчик].ДанныеТерминала[СчетчикДТ];
										
				КонецЕсли;	
			
			КонецЦикла;
			
			НомерПП = НомерПП + 1;
		
		КонецЕсли;
	
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ИтогЗаголовок");
	ТабДокумент.Вывести(Область);
	
	Если ИтогоЗажиганиеВключено+ИтогоЗажиганиеВыключено > 0 Тогда
		
		ОбластьИтогСтрока = Макет.ПолучитьОбласть("ИтогСтрока");
	
		ОбластьИтогСтрока.Параметры.Значение = НСтр("ru = 'Стоянка при включенном зажигании'");
		ОбластьИтогСтрока.Параметры.Продолжительность = ItobОперативныйМониторингКлиентСервер.ПредставлениеВремени(ИтогоЗажиганиеВключено)+" 
		       |("+Формат(ИтогоЗажиганиеВключено/(ИтогоЗажиганиеВключено+ИтогоЗажиганиеВыключено)*100,"ЧЦ=3; ЧДЦ=1; ЧН=0")+"%)";
		ТабДокумент.Вывести(ОбластьИтогСтрока);
		
		ОбластьИтогСтрока.Параметры.Значение = НСтр("ru = 'Стоянка при выключенном зажигании'");
		ОбластьИтогСтрока.Параметры.Продолжительность = ItobОперативныйМониторингКлиентСервер.ПредставлениеВремени(ИтогоЗажиганиеВыключено)+" ("+Формат(ИтогоЗажиганиеВыключено/(ИтогоЗажиганиеВключено+ИтогоЗажиганиеВыключено)*100,"ЧЦ=3; ЧДЦ=1; ЧН=0")+"%)";
		ТабДокумент.Вывести(ОбластьИтогСтрока);		
	
	КонецЕсли;
		
	Возврат ТабДокумент;
	
КонецФункции // СформироватьОтчетПоПростоямПриЗаведенномДвигателе()
	
#КонецОбласти

#Область ОбработчикиСобытий

// Процедура обработчик события "ПриКомпоновкеРезультата" объекта
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
	ДокументРезультат.Вывести(СформироватьОтчетПоПростоямПриЗаведенномДвигателе(
		НачПериода,
		КонПериода,
		Объект));
				
КонецПроцедуры // ПриКомпоновкеРезультата()

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачПериода > КонПериода Тогда
		ТекстОшибки = НСтр("ru='Начало периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Неопределено, // ОбъектИлиСсылка
			"ItobОтчетПоПростоямПриЗаведенномДвигателе",
			"Отчет", // ПутьКДанным
			Отказ);
	КонецЕсли;
		
КонецПроцедуры // ОбработкаПроверкиЗаполнения()
	
#КонецОбласти
